In [3]:
def call1(a, b, c):
    print(a, b, c)

In [5]:
call1(10,20,30) # 위치 매개변수

10 20 30

In [7]:
def call2(a, b, c=50) :
    print(a, b, c)

In [8]:
call2(10, 20) # default 매개변수

10 20 50

### default매개변수는 반드시 뒤에다 위치시켜야 한다.
```python
def call3(a = 10, b, c) ## 오류
```

In [10]:
def call3(a, b=50, c=100):
    print(a,b,c)

In [11]:
call3(10)

10 50 100

In [12]:
def call4(a, b, c):
    print(a, b, c)

In [13]:
call4(a = 100, c = 200, b = 333) # 키워드 파라메터, 순서상관없음

100 333 200

## 파이썬은 오버라이딩은 지원, 오버 로딩은 지원X
### 오버라이딩(재정의) : 상속했을 때 자식클래스의 함수를 재정의하여 기능을 변경
### 오버로딩(다형성 : 하나의 이름으로 다양한 형태를 구현할 수 있는 기능
### 자바는 하나의 함수 이름으로 다양한 입력값의 형태를 정의 가능
### 자바는 오버로딩 가능
### public void add(int x, int y)
### public void add(int x)
### 파이썬은 오버로딩 불가능
### 입력값으로 튜플과 딕셔너리를 여러개 넣을 수 있기 때문에<br>파이썬의 함수 입력값은 0 ~ 무한대의 개수를 가지게 정의할 수 있다.
### 가변 매개변수라고 부른다.

In [14]:
def call5(*a, b):
    print(a)
    print(b)

In [15]:
def call6(*a):
    print(a)

In [ ]:
# call5((1,2,3), 5) 에러발생

#### python.exe프로그램이 한줄을 읽어서 실행을 바로 해준다.<br>번역기

In [16]:
call5((1,2,3), b=5) #위치 가변 매개변수는 보통 단독으로 많이 쓰인다.
# 위치 가변 매개변수를 쓸 때는 다른 매개변수는 키워드(파라메터명)를 
# 반드시 써주어야 헷갈리지 않는다.

((1, 2, 3),)
5

In [17]:
call6(1,2,3,4,5)

(1, 2, 3, 4, 5)

### 파이썬에서는 파라메터의 개수가 정확히 몇개인지 확인하려면<br>함수의 정의를 보고 확인해야한다.(shift + tap)

In [23]:
call6((1,2,3,4,5), (6,7,8)) # 위치 가변 매개변수는 튜플의 튜플도 가능

((1, 2, 3, 4, 5), (6, 7, 8))

## 키워드 가변 매개변수

In [19]:
def call7(**kwargs): 
    print(kwargs)

In [22]:
call7(name = 'hong', age = 100)

{'name': 'hong', 'age': 100}

In [24]:
call7(name = 'hong', age = 100, tel = '010')

{'name': 'hong', 'age': 100, 'tel': '010'}

In [25]:
def call8(*tags, title, content, **kwargs) :
    print('tags>>', tags)
    print('title>>', title)
    print('content>>', content)
    print('kwargs>>', kwargs)

### 가변변수와 함께 쓰는 일반변수는 키워드 변수로 사용해야한다.<br>(변수명과 함께 써주어야 한다.)

In [26]:
call8('바다', '휴양지', '쉼', 
      title='제주도여행', 
      content='해수욕장으로 고고!', 
      location = '제주도 북동부',
      mobe='날아서'
     )

tags>> ('바다', '휴양지', '쉼')
title>> 제주도여행
content>> 해수욕장으로 고고!
kwargs>> {'location': '제주도 북동부', 'mobe': '날아서'}

# 람다함수

In [29]:
def call9(a):
    b = a -1
    return b

### 일반 함수의 4대 조건
#### 함수이름(입력값) : call9(a)
#### 함수처리 내용(a-1)
#### 함수 처리 결과 리턴값(b)

### 람다 함수의 3대 조건
#### (입력값) :
#### 함수처리 내용
#### 함수 처리 결과 리턴값

### list comprechension] => 익명함수의 일종

In [30]:
# lambda => 익명함수의 일종
lambda a : a - 1

In [32]:
(lambda a : a - 1)(10)

9

In [35]:
a_fun = lambda a : a - 1

In [36]:
a_fun(10)

9

In [37]:
lambda a : True if a > 0 else Flase

In [38]:
true_fun = lambda a : True if a > 0 else Flase

In [39]:
true_fun(10)

True

## 입력값이 양수이면 1, 음수이면 0

In [63]:
result1 = lambda a : 1 if a > 0 else 0

In [64]:
result1(-10)

0

## 입력값을 2개 넣어, 더해보기

In [46]:
result2 = lambda a, b : a+b

In [47]:
result2(10,20)

30

## result1를 일반함수로 변경

In [65]:
def result11(a):
    if a > 0 :
        return 1
    else :
        return 0

In [67]:
result11(-10)

0

## 입력값이 2개의 리스트가 되도록 해보기

In [70]:
result2([1,2,3], [4,5,6])

[1, 2, 3, 4, 5, 6]

## 데이터분석에서 있어서 핵심은 df
## 람다를 df를 다룰 때 어떻게 사용해야 하는가?

## 담다함수를 사용하는 이유
### 1. 메모리에 함수의 원형이 저장되지 않음
### 2. 일반 함수보다 쉽고 간단하다

In [1]:
lambda x : x + 1 # lambda 입력파라메터리스트 : 처리내용(반환)

In [2]:
(lambda x : x + 1)(10)

11

In [3]:
add = lambda x : x + 1

In [4]:
add(100), add(101)

(101, 102)

In [8]:
list_data = [1,2,3]

In [12]:
map(add, list_data) # 결과가 map 객체, 사용할 수 없는 형태

### map함수는 많은 양의 데이터(예, 리스트)를<br> 하나씩 꺼내서 함수를 map시켜 실행시켜준다.<br>map함수의 결과는 무조건 map객체이므로,<br>map함수의 결과를 사용하고자 하는 경우, list로 캐스팅 시켜준다.

In [9]:
list(map(add, list_data)) # list <--- map 객체

[2, 3, 4]

## 입력값들이 양수이면, "양수", 음수이면 "음수" 람다함수를 만들기

In [13]:
list_data = [10,20,-30,-40,50]

In [26]:
positive_negative = lambda x : "양수" if x > 0 else "음수"

In [27]:
result = list(map(positive_negative, list_data))

In [34]:
result

['양수', '양수', '음수', '음수', '양수']

In [28]:
import pandas as pd

In [29]:
import numpy as np

In [103]:
df = pd.DataFrame({
    'name' : ['홍길동', '김길동', '홍순신', '정길동', '송사임'],
    'age' : [10, 40, 20, 30, 50]
})
df

  name  age
0  홍길동   10
1  김길동   40
2  홍순신   20
3  정길동   30
4  송사임   50

In [104]:
df['result'] = result
df

  name  age result
0  홍길동   10     양수
1  김길동   40     양수
2  홍순신   20     음수
3  정길동   30     음수
4  송사임   50     양수

In [105]:
age_lambda = lambda x : '고령' if x > 30  else '보통'

In [106]:
list(map(age_lambda, df['age'])) # map(함수명, 리스트형태의 자료구조)

['보통', '고령', '보통', '보통', '고령']

In [107]:
age_result = list(map(age_lambda, df['age']))

In [108]:
df['age_result'] = age_result

In [109]:
df

  name  age result age_result
0  홍길동   10     양수         보통
1  김길동   40     양수         고령
2  홍순신   20     음수         보통
3  정길동   30     음수         보통
4  송사임   50     양수         고령

## 람다함수 만들기
### name에 '홍'이라는 글자를 포함하고 있으면 1, 아니면 0
### 결과로 name_result 파생변수를 만들어보기

In [110]:
name_lambda = lambda x : 1 if '홍' in x else 0

In [111]:
name_result = list(map(name_lambda, df['name']))
name_result

[1, 0, 1, 0, 0]

In [112]:
'홍' in '홍길동' # in 문자열, in의 결과는 Bool

True

In [113]:
1 in [1,2,3] # in 리스트, 리스트내에 1을 포함하는지 여부 확인

True

In [114]:
1 not in [1,2,3] # 1이 포함하지 않는지 확인

False

### 참석확인하려고 하는 이름이 '홍길동'
### 참석자 리스트가 '김길동', '박길동', '송길동'
### 포함여부 확인용 ==> in, not in

In [115]:
'홍길동' in ['김길동', '박길동', '송길동']

False

In [116]:
name_list = ['김길동', '박길동', '송길동']

In [117]:
name = input('확인하고 싶은 이름을 입력하세요')

확인하고 싶은 이름을 입력하세요

In [118]:
if name in name_list :
    print('참석자 명단에 있습니다.')
else:
    print('참석자 명단에 없습니다.')

참석자 명단에 없습니다.

### 일반 함수와 람다함수로 이름을 넣어서 판단하는 처리를 구현

In [119]:
def x(name) :
    name_list = ['김길동', '박길동', '송길동']
    if name in name_list :
        print('참석자 명단에 있습니다.')
    else:
        print('참석자 명단에 없습니다.')

In [120]:
x('고길동')

참석자 명단에 없습니다.

In [121]:
on_lambda = lambda x : '참석자 명단에 있습니다.' if x in name_list else '참석자 명단에 없습니다.'

In [122]:
on_lambda('김길동')

'참석자 명단에 있습니다.'

In [123]:
name_result2 = list(map(name_lambda, df['name']))
name_result2

[1, 0, 1, 0, 0]

In [124]:
df['name_result'] = name_result2
df

  name  age result age_result  name_result
0  홍길동   10     양수         보통            1
1  김길동   40     양수         고령            0
2  홍순신   20     음수         보통            1
3  정길동   30     음수         보통            0
4  송사임   50     양수         고령            0

In [125]:
name_result2 = list(filter(name_lambda, df['name']))
name_result2
# map과 filter 비교
# mapdms true.false의 결과를 모두 다 return
# filter는 true의 결과를 return

['홍길동', '홍순신']

## df의 result 변수의 값이 양수면 1, 음수면 0으로 바꾸기

In [126]:
result_lambda = lambda x : 1 if "양수" == x else 0

In [128]:
df['result'] = list(map(result_lambda, df['result']))
df

  name  age  result age_result  name_result
0  홍길동   10       1         보통            1
1  김길동   40       1         고령            0
2  홍순신   20       0         보통            1
3  정길동   30       0         보통            0
4  송사임   50       1         고령            0

## age_result의 값이 고령이면 1, 아니면 0으로 변경
## age를 10 ~ 20 0, 20 ~ 30 1, 나머지 2

In [129]:
result_lambda2 = lambda x : 1 if x == '고령' else 0

In [130]:
df['age_result'] = list(map(result_lambda2, df['age_result']))

In [131]:
df

  name  age  result  age_result  name_result
0  홍길동   10       1           0            1
1  김길동   40       1           1            0
2  홍순신   20       0           0            1
3  정길동   30       0           0            0
4  송사임   50       1           1            0

In [146]:
def age_func(x) :
    if 10 <= x <= 20:
        return 0 #### map함수내에 사용할 함수는 return을 명시해야 함
    elif 20 < x <= 30:
        return 1
    else :
        return 2

In [148]:
df['age'] = list(map(age_func, df['age']))

In [149]:
df

  name  age  result  age_result  name_result
0  홍길동    0       1           0            1
1  김길동    2       1           1            0
2  홍순신    0       0           0            1
3  정길동    1       0           0            0
4  송사임    2       1           1            0

## apply함수(적용시키다)
### 컬럼명.apply(함수)

In [150]:
df.columns

Index(['name', 'age', 'result', 'age_result', 'name_result'], dtype='object')

In [152]:
df['age'].apply(lambda x : x + 1)

0    1
1    3
2    1
3    2
4    3
Name: age, dtype: int64

### 비파괴라는 것을 알 수 있다.

In [154]:
df['age']

0    0
1    2
2    0
3    1
4    2
Name: age, dtype: int64

In [155]:
df['ageplus1'] = df['age'].apply(lambda x : x + 1)
df

  name  age  result  age_result  name_result  ageplus1
0  홍길동    0       1           0            1         1
1  김길동    2       1           1            0         3
2  홍순신    0       0           0            1         1
3  정길동    1       0           0            0         2
4  송사임    2       1           1            0         3

## 일반함수를 만들어 apply를 적용해 보기
### 이름의 첫글자가 송으로 시작하면 '송', 아니면 첫글자에 해당하는 글자<br>파생변수 name_apply

In [179]:
def start_name(x):
    if x[0] == '송' :
        return '송'
    else :
        return x[0]

In [185]:
df['name_apply'] = df['name'].apply(start_name)
df

  name  age  result  age_result  name_result  ageplus1 name_apply
0  홍길동    0       1           0            1         1          홍
1  김길동    2       1           1            0         3          김
2  홍순신    0       0           0            1         1          홍
3  정길동    1       0           0            0         2          정
4  송사임    2       1           1            0         3          송